; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
	       (handempty)
	       (holding ?x)
	       )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem blocks_words)
	(:domain blocks)
(:objects 

D R A W O E P C - block
)
(:init
(HANDEMPTY)
(CLEAR O)
(ONTABLE O)
(CLEAR R)
(ON R P)
(ONTABLE P)
(CLEAR E)
(ONTABLE E)
(CLEAR D)
(ON D A)
(ON A C)
(ONTABLE C)
(CLEAR W)
(ONTABLE W)
)
(:goal (and
(CLEAR D)(ONTABLE W)(ON D R)(ON R A)(ON A W)
))
)

; plan
1. (unstack d a)
   deleted: (clear d) (handempty) (on d a)
   added: (holding d) (clear a)
   goals met: 1 of 5
2. (stack d o)
   deleted: (holding d) (clear o)
   added: (clear d) (handempty) (on d o)
   goals met: 2 of 5
3. (unstack a c)
   deleted: (clear a) (handempty) (on a c)
   added: (holding a) (clear c)
   goals met: 2 of 5
4. (stack a w)
   deleted: (holding a) (clear w)
   added: (clear a) (handempty) (on a w)
   goals met: 3 of 5
5. (unstack r p)
   deleted: (clear r) (handempty) (on r p)
   added: (holding r) (clear p)
   goals met: 3 of 5
6. (stack r a)
   deleted: (holding r) (clear a)
   added: (clear r) (handempty) (on r a)
   goals met: 4 of 5
7. (unstack d o)
   deleted: (clear d) (handempty) (on d o)
   added: (holding d) (clear o)
   goals met: 3 of 5
8. (stack d r)
   deleted: (holding d) (clear r)
   added: (clear d) (handempty) (on d r)
   goals met: 5 of 5
